## GroupBy

In [1]:
import numpy as np
import pandas as pd

In [5]:
data = {'company' : ['Google','Google','Microsoft','Microsoft','Facebook','Facebook'], 'people' : ['a','b','c','d','e','f'], 'sales' : [1,2,3,4,5,6]}

In [6]:
df = pd.DataFrame(data)
df

     company people  sales
0     Google      a      1
1     Google      b      2
2  Microsoft      c      3
3  Microsoft      d      4
4   Facebook      e      5
5   Facebook      f      6

In [7]:
df1 = df.groupby('company')
df1

In [9]:
df.groupby('company').mean()

           sales
company
Facebook     5.5
Google       1.5
Microsoft    3.5

In [10]:
# or 
df1.mean()

           sales
company
Facebook     5.5
Google       1.5
Microsoft    3.5

In [11]:
df1.min()

          people  sales
company
Facebook       e      5
Google         a      1
Microsoft      c      3

In [13]:
df1.max()

          people  sales
company
Facebook       f      6
Google         b      2
Microsoft      d      4

In [14]:
df1.std()

              sales
company
Facebook   0.707107
Google     0.707107
Microsoft  0.707107

In [15]:
df1.count()

           people  sales
company
Facebook        2      2
Google          2      2
Microsoft       2      2

In [16]:
df1.sum()

           sales
company
Facebook      11
Google         3
Microsoft      7

In [17]:
df1.describe()

          sales
          count mean       std  min   25%  50%   75%  max
company
Facebook    2.0  5.5  0.707107  5.0  5.25  5.5  5.75  6.0
Google      2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0
Microsoft   2.0  3.5  0.707107  3.0  3.25  3.5  3.75  4.0

In [18]:
df1.describe().transpose()

company      Facebook    Google  Microsoft
sales count  2.000000  2.000000   2.000000
      mean   5.500000  1.500000   3.500000
      std    0.707107  0.707107   0.707107
      min    5.000000  1.000000   3.000000
      25%    5.250000  1.250000   3.250000
      50%    5.500000  1.500000   3.500000
      75%    5.750000  1.750000   3.750000
      max    6.000000  2.000000   4.000000

In [22]:
# Just one org
df1.describe().transpose()['Google']

sales  count    2.000000
       mean     1.500000
       std      0.707107
       min      1.000000
       25%      1.250000
       50%      1.500000
       75%      1.750000
       max      2.000000
Name: Google, dtype: float64